![Ironhack Logo](https://i.imgur.com/1QgrNNw.png)

In [2]:
import pymongo 
from pymongo import MongoClient
client = MongoClient ('localhost', 27017)
db = client['companies']

In [3]:
import pandas as pd

In [4]:
data = db.companies.find()

dataframe = pd.DataFrame(list(data))

In [5]:
pd.set_option('display.max_columns', 500)
dataframe.head()

,_id,acquisition,acquisitions,alias_list,blog_feed_url,blog_url,category_code,competitions,created_at,crunchbase_url,deadpooled_day,deadpooled_month,deadpooled_url,deadpooled_year,description,email_address,external_links,founded_day,founded_month,founded_year,funding_rounds,homepage_url,image,investments,ipo,milestones,name,number_of_employees,offices,overview,partners,permalink,phone_number,products,providerships,relationships,screenshots,tag_list,total_money_raised,twitter_username,updated_at,video_embeds
0,52cdef7c4bab8bd675297d8b,None,[],Zoho ManageEngine,,,enterprise,[],2007-05-25 19:24:22,http://www.crunchbase.com/company/adventnet,NaN,NaN,NaN,2.0,Server Management Software,pr@adventnet.com,[],NaN,NaN,1996.0,[],http://adventnet.com,"{'available_sizes': [[[150, 55], 'assets/image...",[],NaN,[],AdventNet,600.0,"[{'description': 'Headquarters', 'address1': '...","<p>AdventNet is now <a href=""/company/zoho-man...",[],abc3,925-924-9500,[],"[{'title': 'DHFH', 'is_past': True, 'provider'...","[{'is_past': True, 'title': 'CEO and Co-Founde...","[{'available_sizes': [[[150, 94], 'assets/imag...",,$0,manageengine,Wed Oct 31 18:26:09 UTC 2012,[]
1,52cdef7c4bab8bd675297d8c,None,[],,http://blogs.zoho.com/feed,http://blogs.zoho.com/,software,"[{'competitor': {'name': 'Empressr', 'permalin...",Fri May 25 19:30:28 UTC 2007,http://www.crunchbase.com/company/zoho,NaN,NaN,NaN,3.0,Online Business Apps Suite,info@zohocorp.com,[{'external_url': 'http://www.online-tech-tips...,15.0,9.0,2005.0,[],http://zoho.com,"{'available_sizes': [[[150, 55], 'assets/image...",[],NaN,"[{'id': 388, 'description': 'Zoho Reaches 2 Mi...",Zoho,1600.0,"[{'description': 'Headquarters', 'address1': '...","<p>Zoho offers a suite of Business, Collaborat...",[],abc4,1-888-204-3539,"[{'name': 'Zoho Office Suite', 'permalink': 'z...",[],"[{'is_past': False, 'title': 'CEO and Founder'...",[],"zoho, officesuite, spreadsheet, writer, projec...",$0,zoho,Wed Oct 30 00:07:05 UTC 2013,"[{'embed_code': '<object width=""430"" height=""2..."
2,52cdef7c4bab8bd675297d8a,"{'price_amount': 30000000, 'price_currency_cod...",[],,http://digitalquarters.net/feed/,http://digitalquarters.net/,web,"[{'competitor': {'name': 'Wikia', 'permalink':...",2007-05-25 06:51:27,http://www.crunchbase.com/company/wetpaint,NaN,NaN,NaN,1.0,Technology Platform Company,info@wetpaint.com,[{'external_url': 'http://www.geekwire.com/201...,17.0,10.0,2005.0,"[{'id': 888, 'round_code': 'a', 'source_url': ...",http://wetpaint-inc.com,"{'available_sizes': [[[150, 75], 'assets/image...",[],NaN,"[{'id': 5869, 'description': 'Wetpaint named i...",Wetpaint,47.0,"[{'description': '', 'address1': '710 - 2nd Av...",<p>Wetpaint is a technology platform company t...,[],abc2,206.859.6300,"[{'name': 'Wikison Wetpaint', 'permalink': 'we...",[],"[{'is_past': False, 'title': 'Co-Founder and V...","[{'available_sizes': [[[150, 86], 'assets/imag...","wiki, seattle, elowitz, media-industry, media-...",$39.8M,BachelrWetpaint,Sun Dec 08 07:15:44 UTC 2013,[]
3,52cdef7c4bab8bd675297d8f,None,[],None,http://feeds.feedburner.com/omnidrive,http://www.omnidrive.com/blog,network_hosting,"[{'competitor': {'name': 'Dropbox', 'permalink...",Sun May 27 03:25:32 UTC 2007,http://www.crunchbase.com/company/omnidrive,15.0,9.0,,2008.0,None,info@omnidrive.com,[],1.0,11.0,2005.0,"[{'id': 225, 'round_code': 'angel', 'source_ur...",http://www.omnidrive.com,"{'available_sizes': [[[150, 85], 'assets/image...",[],None,[],Omnidrive,NaN,"[{'description': '', 'address1': 'Suite 200', ...","<p>Currently in public beta, Omnidrive makes i...",[],omnidrive,660-675-5052,"[{'name': 'Omnidrive', 'permalink': 'omnidrive'}]",[],"[{'is_past': True, 'title': 'Co-founder', 'per...",[],"storage, sharing, edit, online",$800k,Nomadesk,Tue Jul 02 22:48:04 UTC 2013,[]
4,52cdef7c4bab8bd675297d90,"{'price_amount': 625000000, 'price_currency_co...",[],None,,,web,"[{'competitor': {'name': 'RescueTime', 'permal...",Fri Jun 08 12:19:51 UTC 2007,http://www.crunchbase.com/company/postini,NaN,NaN,None,NaN,None,,[],2.0,6.0,1999.0,[],http://postini.com,"{'available_sizes': [[[150, 61], 'assets/image...",[],None,[],Postini,NaN,"[{'description': None, 'address1': '959 Skyway...",<p>Postini focuses on two main issues: securit...,[],postini,888.584.3150,"[{'name': 'Postini Solutions', 'permalink': 'p...",[],"[{'is_past': False, 'title': 'Board', 'person'...",[],,$0,None,Sat Aug 13 18:02:34 UTC 2011,[]

In [128]:
# Las respuestas las voy a mostrar en dataframes, ya que se visualiza mucho mejor. Para pasar los cursores a dataframe,
# voy a usar esta funciÃ³n:

def cursor_a_dataframe(cursor):
    display(pd.DataFrame(list(cursor)))

# Answers
### 1. All the companies that it's name match 'Babelgum'. Retrieve only their `name` field.

In [6]:
babelgum = db.companies.find({"name": "Babelgum"}, {"_id": 0, "name": 1})

In [127]:
list(babelgum)

### 2. All the companies that have more than 5000 employees. Limit the search to 20 companies and sort them by **number of employees**.

In [129]:
many_employees = db.companies.find({"number_of_employees": {"$gt": 5000}}, 
                                   {"_id" : 0, "name": 1, "number_of_employees": 1}
                                  ).sort("number_of_employees", pymongo.ASCENDING
                                        ).limit(15)

In [130]:
print(cursor_a_dataframe(many_employees))

                             name  number_of_employees
0                        Nintendo                 5080
1           Hexaware Technologies                 5200
2                        Facebook                 5299
3                        OpenText                 5300
4                             LSI                 5400
5                      CPM Braxis                 5400
6          Microchip Technologies                 5500
7                        Mediaset                 5729
8   Mindray Medical International                 5763
9                           Baidu                 6000
10                         Dentsu                 6000
11            Tata Communications                 6000
12                          Atmel                 6000
13                         Acxiom                 6200
14                         Acxiom                 6200

None

### 3. All the companies founded between 2000 and 2005, both years included. Retrieve only the `name` and `founded_year` fileds.

In [131]:
early_century = db.companies.find({"founded_year": {"$gte": 2000, "$lte": 2005}}, 
                                  {"_id": 0, "name": 1, "founded_year": 1}
                                 ).limit(15)

In [132]:
print(cursor_a_dataframe(early_century))

    founded_year             name
0           2005             Zoho
1           2005         Wetpaint
2           2005        Omnidrive
3           2004             Digg
4           2003           Gizmoz
5           2002      StumbleUpon
6           2005            Helio
7           2004         Facebook
8           2002            Plaxo
9           2002       Technorati
10          2004          AddThis
11          2004             Veoh
12          2005  Jingle Networks
13          2002           Meetup
14          2005         LifeLock

None

### 4. All the companies that had a Valuation Amount of more than 100.000.000 and have been founded before 2010. Retrieve only the `name` and `ipo` fields.

In [134]:
valuable_new = db.companies.find({"$and": 
                                  [{"ipo.valuation_amount": {"$gt": 100000000}}, 
                                   {"founded_year": {"$lt": 2010}}]}, 
                                 {"_id": 0, "name": 1, "ipo.valuation_amount": 1}
                                ).sort("ipo.valuation_amount", pymongo.ASCENDING
                                      ).limit(15)

In [135]:
print(cursor_a_dataframe(valuable_new))

                                ipo            name
0   {'valuation_amount': 110000000}      Salesforce
1   {'valuation_amount': 134000000}         Geeknet
2   {'valuation_amount': 140000000}      QuinStreet
3   {'valuation_amount': 174000000}           Tudou
4   {'valuation_amount': 235000000}     KIT digital
5   {'valuation_amount': 245000000}       DemandTec
6   {'valuation_amount': 287000000}  ChannelAdvisor
7   {'valuation_amount': 290000000}      Brightcove
8   {'valuation_amount': 315000000}  Rally Software
9   {'valuation_amount': 337000000}         Telenav
10  {'valuation_amount': 350000000}      Shutterfly
11  {'valuation_amount': 450000000}         Opsware
12  {'valuation_amount': 465000000}         Marketo
13  {'valuation_amount': 750000000}             Wix
14  {'valuation_amount': 803000000}      SolarWinds

None

### 5. All the companies that have less than 1000 employees and have been founded before 2005. Order them by the number of employees and limit the search to 10 companies.

In [136]:
small_old = db.companies.find({"$and": 
                                  [{"number_of_employees": {"$lt": 1000}}, 
                                   {"founded_year": {"$lt": 2005}}]},
                              {"_id": 0, "name": 1, "number_of_employees": 1, "founded_year": 1}
                             ).limit(10
                                    ).sort("number_of_employees", pymongo.ASCENDING)

In [137]:
print(cursor_a_dataframe(small_old))

   founded_year                   name  number_of_employees
0          1979  Fox Interactive Media                    0
1          2003                  Skype                    0
2          1976           Ticketmaster                    0
3          2004             stylediary                    0
4          2004              MindTouch                    0
5          2004                  Simpy                    0
6          2004              Eurekster                    0
7          2000                Compete                    0
8          2003               EditGrid                    0
9          1994                Monster                    0

None

### 6. All the companies that don't include the `partners` field.

In [16]:
no_partners = db.companies.find({"partners": []}, {"_id" : 0, "name" : 1}).limit(10)

In [17]:
print(list(no_partners))

[{'name': 'AdventNet'}, {'name': 'Zoho'}, {'name': 'Wetpaint'}, {'name': 'Omnidrive'}, {'name': 'Postini'}, {'name': 'Digg'}, {'name': 'Flektor'}, {'name': 'Geni'}, {'name': 'Fox Interactive Media'}, {'name': 'Gizmoz'}]

### 7. All the companies that have a null type of value on the `category_code` field.

In [138]:
null_category_code = db.companies.find({"category_code": None}, 
                                       {"_id": 0, "name": 1, "category_code": 1}
                                      ).limit(10)

In [139]:
print(cursor_a_dataframe(null_category_code))

  category_code            name
0          None      Collective
1          None         Snimmer
2          None          KoolIM
3          None    Level9 Media
4          None         VidKing
5          None           Drigg
6          None       SpaceTime
7          None   Touch Clarity
8          None    Inside Group
9          None  Repeater Store

None

### 8. All the companies that have at least 100 employees but less than 1000. Retrieve only the `name` and `number of employees` fields.

In [20]:
mediana_empresa = db.companies.find({"$and":
                                     [{"number_of_employees": {"$gte": 100}}, 
                                      {"number_of_employees": {"$lt": 1000}}]},
                                     {"_id": 0, "name": 1, "number_of_employees": 1}
                                   ).limit(10)

In [21]:
print(list(mediana_empresa))

[{'name': 'AdventNet', 'number_of_employees': 600}, {'name': 'AddThis', 'number_of_employees': 120}, {'name': 'OpenX', 'number_of_employees': 305}, {'name': 'LifeLock', 'number_of_employees': 644}, {'name': 'Jajah', 'number_of_employees': 110}, {'name': 'Livestream', 'number_of_employees': 120}, {'name': 'Ustream', 'number_of_employees': 250}, {'name': 'iContact', 'number_of_employees': 300}, {'name': 'Yelp', 'number_of_employees': 800}, {'name': 'Dailymotion', 'number_of_employees': 120}]

### 9. Order all the companies by their IPO price descendently.

In [142]:
ipo_companies = db.companies.find({"ipo.valuation_amount": {"$exists": True}}, 
                                  {"_id": 0, "name": 1, "ipo.valuation_amount": 1}
                                 ).sort("ipo.valuation_amount", pymongo.DESCENDING
                                       ).limit(15)

In [143]:
print(cursor_a_dataframe(ipo_companies))

                                   ipo             name
0   {'valuation_amount': 108960000000}             GREE
1   {'valuation_amount': 104000000000}         Facebook
2   {'valuation_amount': 100000000000}           Amazon
3    {'valuation_amount': 18100000000}          Twitter
4    {'valuation_amount': 12800000000}          Groupon
5    {'valuation_amount': 11000000000}          Tencent
6     {'valuation_amount': 9430000000}  Western Digital
7     {'valuation_amount': 9310000000}         LinkedIn
8     {'valuation_amount': 6000000000}     BMC Software
9     {'valuation_amount': 5440000000}        Rackspace
10    {'valuation_amount': 4000000000}            Baidu
11    {'valuation_amount': 3273770000}      TripAdvisor
12    {'valuation_amount': 3000000000}         HomeAway
13    {'valuation_amount': 2550000000}           Zillow
14    {'valuation_amount': 1600000000}          Nielsen

None

### 10. Retrieve the 10 companies with more employees, order by the `number of employees`

In [144]:
biggest_companies = db.companies.find({}, {"_id": 0, "name": 1, "number_of_employees": 1}
                                     ).sort("number_of_employees", pymongo.DESCENDING
                                           ).limit(10)

In [145]:
print(cursor_a_dataframe(biggest_companies))

                                         name  number_of_employees
0                                     Siemens               405000
1                                         IBM               388000
2                                      Toyota               320000
3                                      PayPal               300000
4  Nippon Telegraph and Telephone Corporation               227000
5                         Samsung Electronics               221726
6                                   Accenture               205000
7                   Tata Consultancy Services               200300
8                   Flextronics International               200000
9                                     Safeway               186000

None

### 11. All the companies founded on the second semester of the year. Limit your search to 1000 companies.

In [146]:
founded_endyear = db.companies.find({"founded_month": {"$gt": 6}}, 
                                    {"_id": 0, "name": 1, "founded_month": 1}
                                   ).limit(1000)

In [147]:
display(pd.DataFrame(list(founded_endyear)).head(15))

    founded_month             name
0               9             Zoho
1              10         Wetpaint
2              11        Omnidrive
3              10             Digg
4              10            Joost
5              11            Plaxo
6               9             eBay
7              10         Powerset
8              12             Kyte
9              12            Thoof
10              9  Jingle Networks
11              8         LifeLock
12             12           Wesabe
13             11          SmugMug
14              7   Pando Networks

### 12. All the companies that have been 'deadpooled' after the third year.

In [159]:
late_deadpool = db.companies.aggregate([{"$project": 
                                       {"_id": 0, "name": 1, "founded_year": 1, "deadpooled_year": 1, 
                                       "difference": {"$subtract": ["$deadpooled_year", "$founded_year"]}}},
                                      {"$match": {"difference": {"$gt": 3}}}, 
                                       {"$limit": 15 }])

In [160]:
print(cursor_a_dataframe(late_deadpool))

    deadpooled_year  difference  founded_year       name
0              2013           6          2007   Babelgum
1              2013           7          2006      Thoof
2              2010           5          2005     Wesabe
3              2013           7          2006    Stickam
4              2008           4          2004   AllPeers
5              2012           6          2006        EQO
6              2007           7          2000   AllofMP3
7              2010           4          2006  SellABand
8              2012           6          2006      Jaiku
9              2011           6          2005       Zlio
10             2009           6          2003    Coghead
11             2010           5          2005     Swivel
12             2011           6          2005      Slide
13             2012           8          2004       Sway
14             2012           6          2006  coComment

None

### 13. All the companies founded before 2000 that have an acquisition amount of more than 10.000.000

In [161]:
old_expensive = db.companies.find({"$and":
                                   [{"acquisition.price_amount": {"$gt": 10000000}},
                                   {"founded_year": {"$lt": 2000}}]}, 
                                 {"_id": 0, "name": 1, "founded_year": 1, "acquisition.price_amount": 1}
                                 ).limit(15)

In [162]:
print(cursor_a_dataframe(old_expensive))

                     acquisition  founded_year              name
0    {'price_amount': 625000000}          1999           Postini
1    {'price_amount': 180000000}          1999          SideStep
2     {'price_amount': 25000000}          1999        Recipezaar
3   {'price_amount': 1500000000}          1998            PayPal
4    {'price_amount': 300000000}          1999          Snapfish
5    {'price_amount': 160000000}          1999           Neopets
6   {'price_amount': 7400000000}          1982  Sun Microsystems
7   {'price_amount': 1200000000}          1999            Zappos
8   {'price_amount': 1000000000}          1999           Alibaba
9   {'price_amount': 1008000000}          1998        Lastminute
10  {'price_amount': 4300000000}          1960             Sabre
11    {'price_amount': 64000000}          1994        Sportsline
12    {'price_amount': 71000000}          1995          Webshots
13  {'price_amount': 1300000000}          1980           Digitas
14    {'price_amount': 11600000}          1999              MIVA

None

### 14. All the companies that have been acquired after 2015, order by the acquisition amount, and retrieve only their `name` and `acquisiton` field.

In [163]:
recently_purchased = db.companies.find({"acquisition.acquired_year": {"$gt": 2013}},
                                       {"_id": 0, "name": 1, "acquisition.acquired_year": 1}
                                      ).sort("acquisition.price_amount")

In [164]:
print(cursor_a_dataframe(recently_purchased))

               acquisition            name
0  {'acquired_year': 2014}  Sense Networks
1  {'acquired_year': 2014}        Nullsoft
2  {'acquired_year': 2014}         Alverix

None

There are no companies acquired after 2015.

### 15. Order the companies by their `founded year`, retrieving only their `name` and `founded year`.

In [169]:
founded_years = db.companies.find({"founded_year": {"$ne": None}}, 
                                  {"_id": 0, "name": 1, "founded_year": 1}
                                 ).sort("founded_year", pymongo.ASCENDING
                                       ).limit(15)

In [170]:
print(cursor_a_dataframe(founded_years))

    founded_year                 name
0           1800           Alstrasoft
1           1800          SmallWorlds
2           1800              US Army
3           1802               DuPont
4           1833             McKesson
5           1833  Bachmann Industries
6           1835          Bertelsmann
7           1836              Accuity
8           1839               CENTRA
9           1840               WeGame
10          1840            VideoSurf
11          1840            VideoSurf
12          1843  The Economist Group
13          1844              Pearson
14          1846     Associated Press

None

### 16. All the companies that have been founded on the first seven days of the month, including the seventh. Sort them by their `aquisition price` descendently. Limit the search to 10 documents.

In [181]:
earlymonth_foundation = db.companies.find({"founded_day": {"$lte": 7}},
                                          {"_id": 0, "name": 1, "founded_day": 1}
                                         ).sort("acquisition.price_amount", pymongo.DESCENDING
                                               ).limit(10)

In [182]:
print(cursor_a_dataframe(earlymonth_foundation))

   founded_day               name
0            4           Netscape
1            1             PayPal
2            1             Zappos
3            1            Alibaba
4            2            Postini
5            1             Danger
6            6  Clearwell Systems
7            1         PrimeSense
8            1             Amobee
9            1        BlueLithium

None

### 17. All the companies on the 'web' `category` that have more than 4000 employees. Sort them by the amount of employees in ascendant order.

In [178]:
big_web_companies = db.companies.find({"$and":
                                       [{"category_code": "web"}, 
                                        {"number_of_employees": {"$gt": 4000}}]},
                                      {"name": 1, "category_code": 1, "number_of_employees": 1}
                                       ).sort("number_of_employees", pymongo.ASCENDING)

In [179]:
print(cursor_a_dataframe(big_web_companies))

,_id,category_code,name,number_of_employees
0,52cdef7c4bab8bd67529822a,web,Expedia,4400
1,52cdef7c4bab8bd675297e96,web,AOL,8000
2,52cdef7c4bab8bd675297ea4,web,Webkinz,8657
3,52cdef7c4bab8bd675297fcb,web,Rakuten,10000
4,52cdef7c4bab8bd67529834c,web,Los Angeles Times Media Group,10000
5,52cdef7d4bab8bd675299d5d,web,Groupon,10000
6,52cdef7c4bab8bd675297da3,web,Yahoo!,13600
7,52cdef7c4bab8bd675297d9b,web,eBay,15000
8,52cdef7c4bab8bd6752982a8,web,Experian,15500

None

### 18. All the companies which their acquisition amount is more than 10.000.000, and currency are 'EUR'.

In [201]:
expensive_euros = db.companies.find({"$and":
                                    [{"acquisition.price_amount": {"$gt": 10000000}}, 
                                     {"acquisition.price_currency_code": "EUR"}]}, 
                                    {"_id": 0, "name": 1, "acquisition.price_amount": 1, 
                                     "acquisition.price_currency_code": 1})

In [202]:
print(cursor_a_dataframe(expensive_euros))

                                         acquisition                 name
0  {'price_amount': 31500000, 'price_currency_cod...                  ZYB
1  {'price_amount': 140000000, 'price_currency_co...              Apertio
2  {'price_amount': 40000000, 'price_currency_cod...    Greenfield Online
3  {'price_amount': 70000000, 'price_currency_cod...              Webedia
4  {'price_amount': 24000000, 'price_currency_cod...            Wayfinder
5  {'price_amount': 70000000, 'price_currency_cod...  Tuenti Technologies
6  {'price_amount': 43400000, 'price_currency_cod...       BioMed Central

None

### 19. All the companies that have been acquired on the first trimester of the year. Limit the search to 10 companies, and retrieve only their `name` and `acquisition` fields.

In [203]:
fta = db.companies.find({"founded_month": {"$lt": 4}}, 
                        {"_id": 0, "name": 1, "acquisition": 1}
                       ).limit(10)

In [204]:
print(cursor_a_dataframe(fta))

                                         acquisition         name
0  {'price_amount': None, 'price_currency_code': ...       Gizmoz
1  {'price_amount': 29000000, 'price_currency_cod...  StumbleUpon
2  {'price_amount': 39000000, 'price_currency_cod...        Helio
3                                               None     Facebook
4                                               None      Twitter
5                                               None     Babelgum
6                                               None       Mahalo
7                                               None       Meetup
8                                               None    Jangl SMS
9                                               None      Prosper

None

### 20. All the companies that have been founded between 2000 and 2010, but have not been acquired before 2011.

In [210]:
earlycentury_stillalive = db.companies.find({"$and":
                                             [{"founded_year": {"$gt": 2000}},
                                              {"founded_year": {"$lt": 2010}},
                                              {"$or":
                                              [{"acquisition.acquired_year": {"$gte": 2011}}, 
                                               {"acquisition.acquired_year": None}]}]}, 
                                            {"_id": 0, "name": 1, "founded_year": 1, "acquisition.acquired_year": 1}
                                           ).limit(15)

In [211]:
print(cursor_a_dataframe(earlycentury_stillalive))

                acquisition  founded_year        name
0                       NaN          2005        Zoho
1   {'acquired_year': 2013}          2005    Wetpaint
2                       NaN          2005   Omnidrive
3   {'acquired_year': 2012}          2004        Digg
4   {'acquired_year': 2012}          2006        Geni
5                       NaN          2007      Scribd
6                       NaN          2006     Slacker
7                       NaN          2004    Facebook
8                       NaN          2007     MeetMoi
9                       NaN          2006     Twitter
10                      NaN          2007    Babelgum
11                      NaN          2002  Technorati
12                      NaN          2004     AddThis
13                      NaN          2007      Mahalo
14                      NaN          2007     Sparter

None